       IDENTIFICATION DIVISION.
       PROGRAM-ID.     EX02.
       AUTHOR.         LUIZ HENRIQUE DE SANTANA 
                       GABRIEL GOMES DA CRUZ
                       NICOLE CARVALHO FUKUSHIMA.
       INSTALLATION.   FATEC-SP.
       DATE-WRITTEN.   07/11/2023.
       DATE-COMPILED.
       SECURITY. APENAS O AUTOR PODE MODIFICAR.
      *REMARKS.  LER ARQUIVO DE ENTRADA CADENT E CLASSIFICAR OS
      *          DADOS NO ARQUIVO DE SAIDA CADSAI, ORDENANDO POR
      *          CODIGO EM ORDEM DESCENDENTE, EXIBINDO APENAS
      *          OS REGISTRO DE SEXO MASCULINOS.
      
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-PC.
       OBJECT-COMPUTER. IBM-PC.
       SPECIAL-NAMES.   DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT CADENT ASSIGN TO DISK ORGANIZATION IS
           LINE SEQUENTIAL.
       SELECT TRAB ASSIGN TO DISK.
       SELECT CADSAI ASSIGN TO DISK ORGANIZATION IS
           LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.

       FD CADENT LABEL RECORD ARE STANDARD VALUE OF FILE-ID
           IS "CADENT.DAT".
       01 REG-ENT.
           02 COD-ENT      PIC 9(05).
           02 NOME-ENT     PIC X(30).
           02 SEX-ENT      PIC X(01).

       SD TRAB.
       01 REG-TRAB.
           02 COD-TRAB    PIC 9(05).
           02 NOME-TRAB   PIC X(30).
           02 SEX-TRAB    PIC X(01).

       FD CADSAI LABEL RECORD ARE STANDARD VALUE OF FILE-ID
           IS "CADSAI.DAT".
       01 REG-SAI.
           02 COD-SAI      PIC 9(05).
           02 NOME-SAI     PIC X(30).
           02 SEX-SAI      PIC X(01).

       WORKING-STORAGE SECTION.
       77 FIM-ARQ PIC XXX VALUE "NAO".

       PROCEDURE DIVISION.
       PGM-EX01.
           SORT TRAB DESCENDING KEY COD-TRAB
               USING CADENT OUTPUT PROCEDURE ROT-SAI.
           STOP RUN.

       ROT-SAI SECTION.
           PERFORM INICIO.
           PERFORM PRINCIPAL UNTIL FIM-ARQ EQUAL "SIM".
           PERFORM TERMINO.
       
       INICIO SECTION.
           OPEN OUTPUT CADSAI.
           PERFORM LEITURA.

       LEITURA SECTION.
           RETURN TRAB AT END MOVE "SIM" TO FIM-ARQ.

       PRINCIPAL SECTION.
           PERFORM SELECAO.
           PERFORM LEITURA.

       SELECAO SECTION.
           IF SEX-TRAB EQUAL "M"
               PERFORM GRAVACAO.

       GRAVACAO SECTION.
           MOVE COD-TRAB TO COD-SAI.
           MOVE NOME-TRAB TO NOME-SAI.
           WRITE REG-SAI.

       TERMINO SECTION.
           CLOSE CADSAI.