       IDENTIFICATION DIVISION.
       PROGRAM-ID.     EX03.
       AUTHOR.         LUIZ HENRIQUE DE SANTANA 
                       GABRIEL GOMES DA CRUZ
                       NICOLE CARVALHO FUKUSHIMA.
       INSTALLATION.   FATEC-SP.
       DATE-WRITTEN.   11/11/2023.
       DATE-COMPILED.
       SECURITY. APENAS O AUTOR PODE MODIFICAR.
      *REMARKS.  LER ARQUIVO DE ENTRADA CADENT E CLASSIFICAR OS
      *          DADOS NO ARQUIVO DE SAIDA CADSAI, ORDENANDO POR
      *          CODIGO EM ORDEM ASCENDENTE, EXIBINDO APENAS
      *          OS REGISTRO COM DEPARTAMENTO 01 E 02.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       OBJECT-COMPUTER. IBM-PC.
       SOURCE-COMPUTER. IBM-PC.
       SPECIAL-NAMES.   DECIMAL-POINT IS COMMA.
       
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT CADENT ASSIGN TO DISK ORGANIZATION IS LINE
           SEQUENTIAL.
       SELECT TRAB ASSIGN TO DISK.
       SELECT CADSAI ASSIGN TO DISK ORGANIZATION IS LINE
           SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       
       FD CADENT LABEL RECORD ARE STANDARD VALUE OF FILE-ID
           IS "CADENT.DAT".
       01 REG-ENT.
           02 COD-ENT      PIC 9(05).
           02 NOME-ENT     PIC X(30).
           02 DEP-ENT      PIC 9(02).
             88 DEP-VALIDO VALUE 01 02.

       SD TRAB.
       01 REG-TRAB.
           02 COD-TRAB    PIC 9(05).
           02 NOME-TRAB   PIC X(30).
           02 DEP-TRAB    PIC X(02).

       FD CADSAI LABEL RECORD ARE STANDARD VALUE OF FILE-ID
           IS "CADSAI.DAT".
       01 REG-SAI.
           02 COD-SAI      PIC 9(05).
           02 NOME-SAI     PIC X(30).
           02 DEP-SAI      PIC X(02).

       WORKING-STORAGE SECTION.
       77 FIM-ARQ PIC XXX VALUE "NAO".

       PROCEDURE DIVISION.
       PGM-EX03.
           SORT TRAB ASCENDING KEY COD-TRAB
               INPUT PROCEDURE ROTINA-ENT GIVING CADSAI.
           STOP RUN.

       ROTINA-ENT SECTION.
           PERFORM INICIO.
           PERFORM PRINCIPAL UNTIL FIM-ARQ EQUAL "SIM".
           PERFORM FIM.
           
       INICIO SECTION.
           OPEN INPUT CADENT.
           PERFORM LEITURA.
       
       LEITURA SECTION.
           READ CADENT AT END MOVE "SIM" TO FIM-ARQ.

       PRINCIPAL SECTION.
           PERFORM SELECAO.
           PERFORM LEITURA.

       SELECAO SECTION.
           IF DEP-VALIDO
               PERFORM GRAVACAO.

       GRAVACAO SECTION.
           MOVE COD-ENT TO COD-TRAB.
           MOVE NOME-ENT TO NOME-TRAB.
           RELEASE REG-TRAB.
           
       FIM SECTION.
           CLOSE CADENT.