       IDENTIFICATION DIVISION.
       PROGRAM-ID.     EXSORT.
       AUTHOR.         LUIZ HENRIQUE DE SANTANA.
       INSTALLATION.   FATEC-SP.
       DATE-WRITTEN.   31/10/2023.
       DATE-COMPILED.
       SECURITY.       APENAS O AUTOR PODE MODIFICA-LO.
      *REMARKS. FAZ O SORT DO ARQUIVO DE ENTRADA.
      *         USANDO USING E GIVING. GERANDO
      *         COMO SAIDA DOIS ARQUIVOS CLASSIFICADOS.
        
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
           SOURCE-COMPUTER. IBM-PC.
           OBJECT-COMPUTER. IBM-PC.
           SPECIAL-NAMES.   DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT ENTRADA ASSIGN TO DISK ORGANIZATION IS
               LINE SEQUENTIAL.
           SELECT TRAB ASSIGN TO DISK.
           SELECT SAI-ORD-COD ASSIGN TO DISK ORGANIZATION IS
               LINE SEQUENTIAL.
           SELECT SAI-ORD-NOME ASSIGN TO DISK ORGANIZATION IS
               LINE SEQUENTIAL.
       
       DATA DIVISION.
       FILE SECTION.
       FD ENTRADA LABEL RECORD ARE STANDARD
           VALUE OF FILE-ID IS "ENT.DAT".
           01 REG-ENT.
             02 COD-ENT  PIC 9(04).
             02 NOME-ENT PIC X(30).

       SD TRAB.
           01 REG-TRAB.
             02 COD-TRAB  PIC 9(04).
             02 NOME-TRAB PIC X(30).
       
       FD SAI-ORD-COD LABEL RECORD ARE STANDARD
           VALUE OF FILE-ID IS "ORD-COD.DAT".
           01 REG-COD.
             02 COD-COD  PIC 9(04).
             02 NOME-COD PIC X(30).

       FD SAI-ORD-NOME LABEL RECORD ARE STANDARD
           VALUE OF FILE-ID IS "ORD-NOME.DAT".
           01 REG-NOME.
             02 COD-NOME  PIC 9(04).
             02 NOME-NOME PIC X(30).

       WORKING-STORAGE SECTION.
       77 FIM-ARQ PIC X(03) VALUE "NAO".

       PROCEDURE DIVISION.
       PGM-EXSORT.
           SORT TRAB ASCENDING KEY COD-TRAB
               USING ENTRADA GIVING SAI-ORD-COD.
           SORT TRAB ASCENDING KEY NOME-TRAB
               USING ENTRADA GIVING SAI-ORD-NOME.
           STOP RUN.